Revit 2027 API
ParameterTypeId.RebarSystemActiveTopDirn1 Property
 "Top Major Direction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemActiveTopDirn1 { get; }
Public Shared ReadOnly Property RebarSystemActiveTopDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemActiveTopDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemActiveTopDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace